#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`Success! The configuration is valid.

`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/SmallWindow21/SmallWindow-Workspace/runs/run-jbpX2hi5VbF9Abvz

Waiting for the plan to start...

Terraform v1.0.0
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
module.networking.aws_eip.nat_elastic_ip: Refreshing state... [id=eipalloc-0108748ea7a4f5785]
module.networking.aws_vpc.main: Refreshing state... [id=vpc-09e33fc5201a9769e]
module.storage.aws_s3_bucket.storage_bucket: Refreshing state... [id=smallwindow21-eu-west-1-541450550503]
module.security.aws_security_group.app_sg: Refreshing state... [id=sg-0146553ef9f349142]
module.networking.aws_internet_gateway.inet_gateway: Refreshing state... [id=igw-0bc1543b1005e6712]
module.networking.aws_subnet.private_subnet_dbase_2: Refreshing state... [id=subnet-0872cf386b97ed260]
module.networking.aws_subnet.private_subnet_dbase_1: Refreshing state... [id=subnet-092d78ac082f20ac4]
module.security.aws_security_group.general_sg: Refreshing state... [id=sg-041ce66c8e1ceb958]
module.networking.aws_subnet.private_subnet_app: Refreshing state... [id=subnet-07334ccdcb1205b58]
module.networking.aws_subnet.public_subnet: Refreshing state... [id=subnet-00b2ace775a871076]
module.security.aws_security_group.dbase_sg: Refreshing state... [id=sg-041b7ff5b605c950c]
module.networking.aws_route_table.public_routing_table: Refreshing state... [id=rtb-0aaac6937b7af4cad]
module.security.aws_security_group_rule.out_http: Refreshing state... [id=sgrule-3224264552]
module.database.aws_db_subnet_group.db_subnet_group: Refreshing state... [id=smallwindow21-dbsubnet-group]
module.networking.aws_nat_gateway.nat_gateway: Refreshing state... [id=nat-0ffcd7f8762e9fee9]
module.security.aws_security_group_rule.out_http_app: Refreshing state... [id=sgrule-2791026544]
module.security.aws_security_group_rule.out_database_from_app: Refreshing state... [id=sgrule-1113556766]
module.security.aws_security_group_rule.in_database_from_app: Refreshing state... [id=sgrule-637993542]
module.networking.aws_route_table_association.public_routing_table_assoc: Refreshing state... [id=rtbassoc-04d821c94192e0ece]
module.networking.aws_route_table.private_routing_table: Refreshing state... [id=rtb-02fde94e2424c8560]
module.database.aws_db_instance.db_instance: Refreshing state... [id=smallwindow21db]
module.networking.aws_route_table_association.private_routing_table_assoc_app: Refreshing state... [id=rtbassoc-0c55b745ed8b0c07d]
module.networking.aws_route_table_association.private_routing_table_assoc_dbase_1: Refreshing state... [id=rtbassoc-09b174dc2ce115cef]
module.networking.aws_route_table_association.private_routing_table_assoc_dbase_2: Refreshing state... [id=rtbassoc-08c04b16ece96b1f2]
module.compute.aws_elastic_beanstalk_application.app_instance: Refreshing state... [id=SmallWindow21]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.networking.aws_eip.nat_elastic_ip has been changed
  ~ resource "aws_eip" "nat_elastic_ip" {
      + association_id       = "eipassoc-08fe3bd61ed01aef2"
        id                   = "eipalloc-0108748ea7a4f5785"
      + network_interface    = "eni-046d4df96ffcf8b51"
      + private_dns          = "ip-192-168-1-224.eu-west-1.compute.internal"
      + private_ip           = "192.168.1.224"
        tags                 = {
            "Name"    = "Small Window 21"
            "Owner"   = "SmallWindow21 Team"
            "project" = "Small Window 21"
        }
        # (7 unchanged attributes hidden)
    }
  # module.security.aws_security_group.dbase_sg has been changed
  ~ resource "aws_security_group" "dbase_sg" {
      ~ egress                 = [
          + {
              + cidr_blocks      = []
              + description      = ""
              + from_port        = 3306
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = [
                  + "sg-0146553ef9f349142",
                ]
              + self             = false
              + to_port          = 3306
            },
        ]
        id                     = "sg-041b7ff5b605c950c"
      ~ ingress                = [
          + {
              + cidr_blocks      = []
              + description      = "Allow traffic on port 3306 from the App Security Group"
              + from_port        = 3306
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = [
                  + "sg-0146553ef9f349142",
                ]
              + self             = false
              + to_port          = 3306
            },
        ]
        name                   = "Database Security Group"
        tags                   = {
            "Name"    = "Database Security Group"
            "project" = "Small Window 21"
        }
        # (6 unchanged attributes hidden)
    }
  # module.security.aws_security_group.general_sg has been changed
  ~ resource "aws_security_group" "general_sg" {
      ~ egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
        ]
        id                     = "sg-041ce66c8e1ceb958"
        name                   = "General Security Group"
        tags                   = {
            "Name"    = "General Security Group"
            "project" = "Small Window 21"
        }
        # (7 unchanged attributes hidden)
    }
  # module.security.aws_security_group_rule.in_database_from_app has been changed
  ~ resource "aws_security_group_rule" "in_database_from_app" {
      + cidr_blocks              = []
        id                       = "sgrule-637993542"
      + ipv6_cidr_blocks         = []
      + prefix_list_ids          = []
        # (8 unchanged attributes hidden)
    }
  # module.security.aws_security_group_rule.out_database_from_app has been changed
  ~ resource "aws_security_group_rule" "out_database_from_app" {
      + cidr_blocks              = []
        id                       = "sgrule-1113556766"
      + ipv6_cidr_blocks         = []
      + prefix_list_ids          = []
        # (7 unchanged attributes hidden)
    }
  # module.security.aws_security_group_rule.out_http has been changed
  ~ resource "aws_security_group_rule" "out_http" {
        id                = "sgrule-3224264552"
      + ipv6_cidr_blocks  = []
      + prefix_list_ids   = []
        # (7 unchanged attributes hidden)
    }
  # module.security.aws_security_group_rule.out_http_app has been changed
  ~ resource "aws_security_group_rule" "out_http_app" {
        id                = "sgrule-2791026544"
      + ipv6_cidr_blocks  = []
      + prefix_list_ids   = []
        # (8 unchanged attributes hidden)
    }
  # module.security.aws_security_group.app_sg has been changed
  ~ resource "aws_security_group" "app_sg" {
      ~ egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow TCP internet traffic egress from app layer"
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
        ]
        id                     = "sg-0146553ef9f349142"
        name                   = "App Security Group"
        tags                   = {
            "Name"    = "App Security Group"
            "project" = "Small Window 21"
        }
        # (7 unchanged attributes hidden)
    }
  # module.compute.aws_elastic_beanstalk_application.app_instance has been changed
  ~ resource "aws_elastic_beanstalk_application" "app_instance" {
        id          = "SmallWindow21"
        name        = "SmallWindow21"
      + tags        = {}
        # (3 unchanged attributes hidden)
    }
  # module.database.aws_db_instance.db_instance has been changed
  ~ resource "aws_db_instance" "db_instance" {
      + enabled_cloudwatch_logs_exports       = []
        id                                    = "smallwindow21db"
        name                                  = "smallwindow21db"
      + security_group_names                  = []
        tags                                  = {
            "Name"    = "smallwindow21db"
            "Owner"   = "SmallWindow21 Team"
            "project" = "Small Window 21"
        }
        # (42 unchanged attributes hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.compute.aws_elastic_beanstalk_environment.app_instance_environment will be created
  + resource "aws_elastic_beanstalk_environment" "app_instance_environment" {
      + all_settings           = (known after apply)
      + application            = "SmallWindow21"
      + arn                    = (known after apply)
      + autoscaling_groups     = (known after apply)
      + cname                  = (known after apply)
      + cname_prefix           = (known after apply)
      + endpoint_url           = (known after apply)
      + id                     = (known after apply)
      + instances              = (known after apply)
      + launch_configurations  = (known after apply)
      + load_balancers         = (known after apply)
      + name                   = "develop"
      + platform_arn           = (known after apply)
      + queues                 = (known after apply)
      + solution_stack_name    = "64bit Amazon Linux 2018.03 v2.16.8 running Docker 19.03.13-ce"
      + tags                   = {
          + "Owner"   = "SmallWindow21 Team"
          + "project" = "Small Window 21"
        }
      + tags_all               = {
          + "Owner"   = "SmallWindow21 Team"
          + "project" = "Small Window 21"
        }
      + tier                   = "WebServer"
      + triggers               = (known after apply)
      + version_label          = (known after apply)
      + wait_for_ready_timeout = "20m"

      + setting {
          + name      = "ELBSubnets"
          + namespace = "aws:ec2:vpc"
          + value     = "subnet-00b2ace775a871076"
        }
      + setting {
          + name      = "IamInstanceProfile"
          + namespace = "aws:autoscaling:launchconfiguration"
          + value     = (known after apply)
        }
      + setting {
          + name      = "InstanceTypes"
          + namespace = "aws:ec2:instances"
          + value     = "t2.micro"
        }
      + setting {
          + name      = "MaxSize"
          + namespace = "aws:autoscaling:asg"
          + value     = "1"
        }
      + setting {
          + name      = "MinSize"
          + namespace = "aws:autoscaling:asg"
          + value     = "1"
        }
      + setting {
          + name      = "SecurityGroups"
          + namespace = "aws:autoscaling:launchconfiguration"
          + value     = "sg-041ce66c8e1ceb958, sg-0146553ef9f349142"
        }
      + setting {
          + name      = "SecurityGroups"
          + namespace = "aws:elbv2:loadbalancer"
          + value     = "sg-041ce66c8e1ceb958"
        }
      + setting {
          + name      = "Subnets"
          + namespace = "aws:ec2:vpc"
          + value     = "subnet-07334ccdcb1205b58"
        }
      + setting {
          + name      = "VPCId"
          + namespace = "aws:ec2:vpc"
          + value     = "vpc-09e33fc5201a9769e"
        }
      + setting {
          + name      = "db_address"
          + namespace = "aws:elasticbeanstalk:application:environment"
          + value     = "smallwindow21db.c2gxikrbn8ye.eu-west-1.rds.amazonaws.com"
        }
      + setting {
          + name      = "db_endpoint"
          + namespace = "aws:elasticbeanstalk:application:environment"
          + value     = "smallwindow21db.c2gxikrbn8ye.eu-west-1.rds.amazonaws.com:3306"
        }
      + setting {
          + name      = "db_password"
          + namespace = "aws:elasticbeanstalk:application:environment"
          + value     = (known after apply)
        }
      + setting {
          + name      = "db_port"
          + namespace = "aws:elasticbeanstalk:application:environment"
          + value     = "3306"
        }
      + setting {
          + name      = "db_username"
          + namespace = "aws:elasticbeanstalk:application:environment"
          + value     = "smallwindow21"
        }
      + setting {
          + name      = "storage_bucket_name"
          + namespace = "aws:elasticbeanstalk:application:environment"
          + value     = "smallwindow21-eu-west-1-541450550503"
        }
    }

  # module.database.aws_db_instance.db_instance will be updated in-place
  ~ resource "aws_db_instance" "db_instance" {
        id                                    = "smallwindow21db"
        name                                  = "smallwindow21db"
      ~ password                              = (sensitive value)
        tags                                  = {
            "Name"    = "smallwindow21db"
            "Owner"   = "SmallWindow21 Team"
            "project" = "Small Window 21"
        }
        # (43 unchanged attributes hidden)
    }

  # module.database.random_string.db_password will be created
  + resource "random_string" "db_password" {
      + id          = (known after apply)
      + length      = 16
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + result      = (known after apply)
      + special     = false
      + upper       = true
    }

  # module.security.aws_iam_instance_profile.eb_profile will be created
  + resource "aws_iam_instance_profile" "eb_profile" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = "SmallWindow21-Profile"
      + path        = "/"
      + role        = "SmallWindow21-Role"
      + tags_all    = (known after apply)
      + unique_id   = (known after apply)
    }

  # module.security.aws_iam_role.eb_role will be created
  + resource "aws_iam_role" "eb_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "SmallWindow21-Role"
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

Plan: 4 to add, 1 to change, 0 to destroy.

Changes to Outputs:
  + elasticbeanstalk_app_cname                 = (known after apply)
  + elasticbeanstalk_app_loadbalancer_endpoint = (known after apply)

```

</details>

*Pusher: @L00162772, Action: `pull_request`*